---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.ComplexWithMullionsAndShadingSurfaces
enum: Autodesk.Revit.DB.Analysis.gbXMLExportComplexity
source: html/f1e171a8-a220-13c0-a088-853f43003bb8.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.ComplexWithMullionsAndShadingSurfaces

Using this enumeration, mullions will be exported as shading
 surfaces. A "simplified" analytical shading surface is produced
 from a mullion based on its centerline, thickness and offset.